app/controllers/users_controller.rb

  def get_token
    @user = User.find(1)
    @user.token = @user.uriToken[:access_token]
    @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
UPDATE "users" SET "token" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["token", "c203769ef10878daac161ad2edd23a87044cceec"], ["updated_at", "2016-07-21 22:46:46.994462"], ["id", 1]]

  def neighbour_traffic
    @user = User.find(1)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]

  def dataPointers
    @user = User.find(current_user)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]